/***********************/
/*****Te3Ka_PaynE*******/
/*Mnement4813@yandex.ru*/
/***********************/

/*
Написать программу, которая генерирует случайное
трёхзначное число
и удаляет вторую цифру этого числа.
456 -> 46
782 -> 72
918 -> 98
*/

Console.WriteLine("Программа генерирует случайное трёхзначное целое положительное число, после чего удаляет из него вторую цифру и выводит полученный результат на экран.");
int randomNumber = Random.Next(100, 1000);

